"""
Символ дружбы
С древних времен пару чисел 220 и 284 считали символом дружбы.
 В средние века имели хождение талисманы с выгравированными на них числами 220 и 284,
 якобы способствующими укреплению любви. Чем же заинтересовали людей эти два с виду обыкновенных числа?
Список собственных делителей числа 220:
Дружественные числа были открыты последователями Пифагора.
Напишите программу, которая проверяет пару чисел на "дружественность". Используйте функцию, которая вычисляет сумму делителей числа.

Входные данные:
В строке через пробел записаны два натуральных числа.

Выходные данные
Программа должна вывести слово 'YES', если полученные числа – дружественные, и слово 'NO' в противном случае.

Sample Input:

220 284
"""

