# Черное-белое
"""
Вася силен в математике, а вот с написанием сочинений совсем беда.
Для того, чтобы пополнить словарный запас, ему купили большой словарь антонимов, состоящий из пар слов.
Каждое слово является антонимом к парному ему слову. Все слова в словаре различны. Помогите Васе найти антоним к нужному слову.

Входные данные:
На вход количество N пар антонимов, далее следует N строк, каждая строка содержит ровно два слова-антонима, разделенные пробелом.
После этого следует одно слово, к которому нужно найти антоним.
Выходные данные:

Программа выводит антоним к данному слову.

Sample Input:

3
черное белое
день ночь
далеко близко
день
"""

